
{
  "1": {
    "1": "Tamam tareef Allah hi ke liye hai jo saare jahan ka malik hai",
    "2": "Rahmaan aur raheem hai",
    "3": "Roze jaza ka malik hai",
    "4": "Hum teri hi ibadat karte hain aur tujhi se madad mangte hain",
    "5": "Hamein seedha rasta dikhao",
    "6": "Un logon ka rasta jin par tune ehsaan kiya hai",
    "7": "Na un ka jin par tera ghazab hua aur na un ka jo gumrah hue"
  },
  "2": {
    "1": "Alif Laam Meem",
    "2": "Yeh woh kitab hai jis mein koi shak nahi, muttaqiyon ke liye hidayat hai",
    "3": "Jo ghaib par iman laate hain aur namaz qayam karte hain aur jo kuch hum ne unhen diya hai us mein se kharch karte hain",
    "4": "Aur jo iman laate hain us par jo tumhare upar nazil kiya gaya aur jo tumhare pahle nazil kiya gaya aur wo akhirat par yaqeen rakhte hain",
    "5": "Yahi log apne rabb ki taraf se hidayat par hain aur yahi kamyab hain"
  },
  "3": {
    "1": "Alif Laam Meem",
    "2": "Allah, koi ilaah nahi siwa us ke, zinda hai qayam rahne wala",
    "3": "Us ne tumhare upar kitab nazil ki haq ke saath"
  },
  "4": {
    "1": "Ae logon! Apne us rabb se daro jis ne tumhen ek jaan se paida kiya",
    "2": "Aur us se us ki biwi banai aur un dono se bahut se mard aur aurat phailaye"
  },
  "5": {
    "1": "Ae iman walo! Apne aqd pure karo",
    "2": "Tumhare liye chaupayon ka gosht halal kiya gaya hai"
  },
  "6": {
    "1": "Tamam tareef Allah hi ke liye hai jis ne aasman aur zameen banaye",
    "2": "Aur andheyon aur ujale banaye"
  },
  "7": {
    "1": "Alif Laam Meem Saad",
    "2": "Yeh kitab tumhare upar nazil ki gayi hai"
  },
  "8": {
    "1": "Tumse maal e ghaneemat ke bare mein puchte hain",
    "2": "Keh do maal e ghaneemat Allah aur rasool ka hai"
  },
  "9": {
    "1": "Allah aur us ke rasool ki taraf se bari hai mushrikeen se",
    "2": "Phir agar tum tauba kar lo to tumhare liye behtar hai"
  },
  "10": {
    "1": "Alif Laam Ra. Yeh aayaten hain hikmat wali kitab ki",
    "2": "Kya logon ke liye ta'ajjub ki baat hai"
  },
  "11": {
    "1": "Alif Laam Ra. Yeh woh kitab hai jis ki aayaten muhkam hain",
    "2": "Phir tafseel se bayan ki gayi hain"
  },
  "12": {
    "1": "Alif Laam Ra. Yeh aayaten hain saaf kitab ki",
    "2": "Hum ne ise arabi quran banaya hai"
  },
  "13": {
    "1": "Alif Laam Meem Ra. Yeh aayaten hain kitab ki",
    "2": "Aur jo kuch tumhare rabb ki taraf se nazil kiya gaya hai woh haq hai"
  },
  "14": {
    "1": "Alif Laam Ra. Yeh kitab hai jo hum ne tumhare upar nazil ki",
    "2": "Ta ke tum logon ko andheyon se ujale ki taraf nikalo"
  },
  "15": {
    "1": "Alif Laam Ra. Yeh aayaten hain kitab aur saaf quran ki",
    "2": "Kaafiron ki dil mein hasrat hogi"
  },
  "16": {
    "1": "Allah ka hukm aa chuka to us mein jaldi na karo",
    "2": "Woh pak hai aur buland hai"
  },
  "17": {
    "1": "Pak hai woh jo apne bande ko raat ke waqt le gaya",
    "2": "Masjid e haram se masjid e aqsa tak"
  },
  "18": {
    "1": "Tamam tareef Allah hi ke liye hai jis ne apne bande par kitab nazil ki",
    "2": "Aur us mein koi tedhi baat nahi rakhi"
  },
  "19": {
    "1": "Kaaf Ha Ya Ain Saad",
    "2": "Tumhare rabb ki rahmat ka zikr hai"
  },
  "20": {
    "1": "Ta Ha",
    "2": "Hum ne tumhare upar quran nazil nahi kiya"
  },
  "21": {
    "1": "Logon ke liye unka hisab qareeb aa gaya",
    "2": "Aur wo ghaflat mein muh phere hue hain"
  },
  "22": {
    "1": "Ae logon! Apne rabb se daro",
    "2": "Qayamat ka zalzala bara sakht hai"
  },
  "23": {
    "1": "Kamyab ho gaye momineen",
    "2": "Jo apni namaz mein khushu karte hain"
  },
  "24": {
    "1": "Yeh surah hai jo hum ne nazil ki",
    "2": "Aur ise farz kiya aur us mein saaf aayaten nazil keen"
  },
  "25": {
    "1": "Bara barkat wala hai woh jis ne apne bande par furqan nazil kiya",
    "2": "Ta ke tamam jahan ke liye darr sunane wala ho"
  },
  "26": {
    "1": "Ta Seen Meem",
    "2": "Yeh aayaten hain saaf kitab ki"
  },
  "27": {
    "1": "Ta Seen. Yeh aayaten hain quran aur saaf kitab ki",
    "2": "Hidayat aur khushkhabri hai momineen ke liye"
  },
  "28": {
    "1": "Ta Seen Meem",
    "2": "Yeh aayaten hain saaf kitab ki"
  },
  "29": {
    "1": "Alif Laam Meem",
    "2": "Kya logon ne yeh samjha hai ke wo sirf yeh keh kar chhod diye jayenge"
  },
  "30": {
    "1": "Alif Laam Meem",
    "2": "Room maghloob ho gaye qareeb ki zameen mein"
  }
}
